//=================================================================================
//
//    Battle Action header
//    Author : Lin He                                        作成日 : 2019/01/13
//
//=================================================================================

#ifndef _BATTLE_ACTION_H_
#define _BATTLE_ACTION_H_

#include "Animation.h"

//*****************************************************************************
//	BattleAction
//
//　戦闘中キャラクターが行う行動を表す構造体
//	行動は、TypeとIdがあって、Typeからどういう風な行動をとるか（どのテーブルデータを使うか）を決めて、
//	Idから具体的に行動を決める
//	例: type=SKILL,id = 0の行動は、SKILLテーブルの0番のデータを使う行動である
//*****************************************************************************
struct BattleAction
{
	//行動の種類enum
	enum Type
	{
		STANDBY,
		ATTACK,
		SKILL,
		ALCHEMY
	};

	//行動の種類
	Type type;

	//行動ID
	int id;
	//行動のターゲットのID
	int target_id;
	//行動のアニメーションID
	ANIM_ENUM anim_enum;
};

#endif